In [3]:
#import libraries 
import pandas as pd 
import numpy as np
import sqlite3 
import matplotlib.pyplot as plt

In [4]:
conn=sqlite3.connect('/Users/kryst/Library/DBeaverData/workspace6/.metadata/sample-database-sqlite-1/Chinook.db')
df = pd.read_sql_query("select a.name as Artist_Name\
, al.title as Album_Title \
, g.name as Genre \
, t.Composer \
, t.Name as Track \
, t.UnitPrice as Track_Cost \
,i.InvoiceId \
, il.UnitPrice as Track_Price \
, e.EmployeeId, e.FirstName as SR_firstname \
,e.LastName as SR_lastname \
, e.Title as SR_Title \
,e.City as SR_city \
, e.State as SR_State \
, e.Country as SR_Country \
, c.CustomerId \
, c.FirstName as Customer_FirstName \
, c.LastName as Customer_LastName \
,c.City as Customer_City \
, c.State as Customer_State \
, c.Country as Customer_Country \
From Artist a \
left Join Album al on a.ArtistId = al.ArtistId \
Left Join Track t  on al.AlbumId = t.AlbumId  \
Left Join Genre g on t.GenreId = g.GenreId \
Left Join InvoiceLine il on t.TrackId = il.TrackId \
left Join Invoice i on il.InvoiceId = i.InvoiceId \
Left join Customer c on i.CustomerId = c.CustomerId \
left join Employee e on e.EmployeeId = c.SupportRepId", conn)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3830 entries, 0 to 3829
Data columns (total 21 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Artist_Name         3830 non-null   object
 1   Album_Title         3759 non-null   object
 2   Genre               3759 non-null   object
 3   Composer            2712 non-null   object
 4   Track               3759 non-null   object
 5   Track_Cost          3759 non-null   float64
 6   InvoiceId           2240 non-null   float64
 7   Track_Price         2240 non-null   float64
 8   EmployeeId          2240 non-null   float64
 9   SR_firstname        2240 non-null   object
 10  SR_lastname         2240 non-null   object
 11  SR_Title            2240 non-null   object
 12  SR_city             2240 non-null   object
 13  SR_State            2240 non-null   object
 14  SR_Country          2240 non-null   object
 15  CustomerId          2240 non-null   float64
 16  Customer_FirstName  2240 non-null   object
 17  Customer_LastName   2240 non-null   object
 18  Customer_City       2240 non-null   object
 19  Customer_State      1140 non-null   object
 20  Customer_Country    2240 non-null   object
dtypes: float64(5), object(16)
memory usage: 628.5+ KB

In [6]:
df1 = df

In [7]:
df1['Artst2']=pd.read_sql_query("select \
CASE \
When Name  like 'Academy of St. Martin%' then 'Academy of St. Martin' \
When Name like 'Aerosmith%' then 'Aerosmith' \
WHEN Name like 'Battlestar%' then 'Battlestar' \
When Name like 'Berliner%' then 'Berliner Philharmoniker' \
when Name like 'Chicago Symphony%' then 'Chicaco Symphony' \
when Name like 'Milton%' then 'Milton Nascimento' \
when Name like 'Motörhead%' then 'Motorhead' \
when Name like 'Otto%' then 'Otto' \
when Name like 'Pedro%'then 'Pedro Luis' \
when Name Like 'R.E.M.%' then 'R.E.M.' \
when Name like 'Santana%' then 'Santana' \
when Name Like 'Sir Georg Solti%' then 'Sir Georg Solti' \
when Name like 'Vinícius De Moraes & Baden Powell%' then 'Vinìcius De Moraes' \
Else Name \
END as artist2 \
from Artist",conn)

In [8]:
df1.to_csv('/Users/kryst/Documents/Data analysis files/Python/EDAProject.csv')

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3830 entries, 0 to 3829
Data columns (total 22 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Artist_Name         3830 non-null   object
 1   Album_Title         3759 non-null   object
 2   Genre               3759 non-null   object
 3   Composer            2712 non-null   object
 4   Track               3759 non-null   object
 5   Track_Cost          3759 non-null   float64
 6   InvoiceId           2240 non-null   float64
 7   Track_Price         2240 non-null   float64
 8   EmployeeId          2240 non-null   float64
 9   SR_firstname        2240 non-null   object
 10  SR_lastname         2240 non-null   object
 11  SR_Title            2240 non-null   object
 12  SR_city             2240 non-null   object
 13  SR_State            2240 non-null   object
 14  SR_Country          2240 non-null   object
 15  CustomerId          2240 non-null   float64
 16  Customer_FirstName  2240 non-null   object
 17  Customer_LastName   2240 non-null   object
 18  Customer_City       2240 non-null   object
 19  Customer_State      1140 non-null   object
 20  Customer_Country    2240 non-null   object
 21  Artst2              275 non-null    object
dtypes: float64(5), object(17)
memory usage: 658.4+ KB